app/Controllers/CustomerController.php

SELECT *
FROM `customers`
WHERE `soft_delete` = 0
ORDER BY `id` DESC
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `customers`
WHERE `soft_delete` = 0
---
    public function index()
    {
        $data['customerList']   = $this->customer->orderby('id', 'DESC')
                                    ->where('soft_delete', 0)
                                    ->paginate(3, 'group1');

SELECT *
FROM `customers`
WHERE `id` = '5'
 LIMIT 1
---
    public function getOne($id)
    {
        try
        {
            $data = $this->customer->where('id', $id)->first();

UPDATE `customers` SET `soft_delete` = '1'
WHERE `customers`.`id` IN ('')
---
    public function deleteList()
    {
        try
        {
            $ids   = $this->request->getPost('delete_id');
            $data = [
                'soft_delete' => '1'
            ];

            $this->customer->update($ids, $data);

UPDATE `customers` SET `soft_delete` = '1'
WHERE `customers`.`id` IN ('2')
---
    public function deleteAllList()
    {
        try
        {
            $ids   = $this->request->getVar('ids');

            $data = [
                'soft_delete' => '1'
            ];

            foreach( $ids as $index => $id)
            {
                $this->customer->update($id, $data);